{
    "name":"Dennis Morozov",
    "home":{
        "heading":"Thank you for your interest.",
        "body":"Whether you are here as a recruiter, friend, or secret admirer, welcome to my microcosm. With this portfolio, I aim to craft an online presence and provide a more engaging medium for my resume. Enjoy the discovery!",
        "image":"home2.jpg"
    },
    "about":{
        "heading":"Hi, I'm Dennis",
        "body":["The world is wonderful and always in motion. The electrifying hum of productivity, innovation, creativity and information sharing is a palpable source of energy. I feel incredibly fortunate to draw inspiration from nearly everything that surrounds me. ",
            "Dennis has a Master’s in Data Analytics from the Georgia Institute of Technology and leads data science teams to deliver machine learning (ML) products across healthcare, energy, and consulting industries. Dennis is a lifelong learner and revels in all the exciting innovations and developments in the ML field. ",
            "Passionate about learning the principles of the physical world, Dennis focused his early career in the field of mechanical engineering. He earned a Bachelor's in Mechanical Engineering from the University of Tennessee and spent the first several years of his career designing airplane engine parts and performing structural analysis at Pratt and Whitney (P&W). During his engineering work at P&W, Dennis transitioned the focus of his work to big data analysis and developing tools and systems to support distributed processing on the large volume of data collected from engine sensors. The slow transition accelerated into a career change, and a complete focus on machine learning applications across different industries. ",
            "Dennis led teams to successfully deliver specialized and custom products using natural language processing (NLP) and computer vision (CV), and generative artificial intelligence (AI) domains.  To complement his leadership skills, he also excels at technical and hands-on work. He has experience with system architecture design and implementation for distributed processing and big data analysis. Dennis worked on R&D projects with  Graph Networks, Reinforcement Learning, Transformers, and Generative AI paradigms such as Variational Autoencoders (VAEs), Generative Adversarial Networks (GANs), Normalizing  Flow Models (NFMs), Energy-Based Models (EBMs), and Diffusion Models. Dennis also has experience with developing tools with open source and proprietary Large Language Models (LLMs), implementing common patterns such as retrieval-augmented generation (RAG) and LLM based agents (CoT, ReAct… etc.). "],
        "image":"personal_image.jpg",
        "connections":[
            {
                "network":"linkedin",
                "url":"https://www.linkedin.com/in/dennis-alexander-morozov"
            },
            {
                "network":"github",
                "url":"https://github.com/dennismdan/"
            },
            {
                "network":"email",
                "url":"mailto:dennismdan@gmail.com"
            }
        ]
    },
    "resume":{
        "experiences":[
            {
                "icon":"python.png",
                "title":"Python"
            },            
            {
                "icon":"js.png",
                "title":""
            },
            {
                "icon":"aws-cp.png",
                "title":"AWS"
            },            
            {
                "icon":"docker.png",
                "title":""},
            {
                "icon":"kubernetes.png",
                "title":""
            }, 
            {
                "icon":"tensor-flow.png",
                "title":"Tensor Flow"
            },
            {
                "icon":"pytorch.png",
                "title":"PyTorch"
            },
            {
                "icon":"react.png",
                "title":"React"
            },
            {
                "icon":"flutter.png",
                "title":"Flutter"
            },
            {
                "icon":"spark.png",
                "title":""
            },            
            {
                "icon":"hadoop.png",
                "title":""
            },            
            {
                "icon":"hive.png",
                "title":""
            },         
            {
                "icon":"mlflow.png",
                "title":""
            },      
            {
                "icon":"prometheus.png",
                "title":""
            },
            {
                "icon":"powerbi.png",
                "title":""
            },            
            {
                "icon":"tableau.png",
                "title":""
            },              
            {
                "icon":"graphana.png",
                "title":""
            }
        ],
        "commercial":[
            {"position":"Lead Data Scientist: Generative AI and Computer Vision",
            "company":"SFL Scientific, A Deloitte Business",
            "dates":"Jan 2022 - Present",
            "address":"Boston, MA 02169",
            "description":"Led client projects and proof of concept (POC) engagements.  Developed, and deployed custom variational autoencoders (VAEs) to generate novel nuclear fuel loading patterns for nuclear power plant burn cycles. Developed applications with open source and proprietary large language models (LLMs) with chain-of-thought (CoT) and reason-act (ReAct) agents with access to various toolkits. Experience with other generative architectures: GANs, energy based, diffusion, and normalizing flow models.",
            "logo":"sfl-logo.png"},
            {"position":"Lead Data Scientist: Natural Language Processing (NLP)",
            "company":"SFL Scientific, A Deloitte Business",
            "dates":"Jan 2022 - Present",
            "address":"Boston, MA 02169",
            "description":"Led teams of Data Scientists to design and develop models that ingest structured and unstructured data to find anomalies, define topics, generate summarizations, identify product names and personalities, and identify trends over time. Developed retrieval-augmented generation (RAG) applications for healthcare, energy, and consulting industries. ",
            "logo":"sfl-logo.png"},
            {"position":"Lead Data Scientist: Infrastructure and Compute",
            "company":"SFL Scientific, A Deloitte Business",
            "dates":"Jan 2022 - Present",
            "address":"Boston, MA 02169",
            "description":"Led internal efforts to establish coding best practices and MLOps workflows and pipelines. Deployed Kubernetes architecture for persistent services with API access. Developed distributed processing pipelines with Dask on NVIDIA DGX cluster. Developed PyTorch and Tensorflow models with multi-GPU processing using NVIDIA A100 GPUs.",
            "logo":"sfl-logo.png"},
            {"position":"Python Developer and Data Scientist",
            "company":"Pratt and Whitney",
            "dates":"Jan 2020 - Present",
            "address":"East Hartford, CT 06118",
            "description":"Designed ML tools and architecture on Hadoop ecosystem and AWS cloud to support python applications for big data analysis on distributed systems. Designed and developed in-house python application for distributed data analysis, data management, and analysis visualization.",
            "logo":"pratt-logo.png"},
            {"position":"Structures Engineer",
            "company":"Pratt and Whitney",
            "dates":"May 2019 – Jan 2020",
            "address":"East Hartford, CT 06118",
            "description":"Designed jet engine parts for gearbox, oil pump, and forward bearing compartment from early concept design to late-stage product design. Built ANSYS and analytical models to analyze the structural integrity of high-speed rotating parts. Performed low and high cycle fatigue analysis, and fracture mechanics for various aerospace alloys.",
            "logo":"pratt-logo.png"},
            {"position":"Mechanical System Design Engineer",
            "company":"Pratt and Whitney",
            "dates":"Sept 2017 – May 2019",
            "address":"East Hartford, CT 06118",
            "description":"Supported the design of gearbox, oil pump, and forward bearing compartment for a development jet engine, and performed design and assembly studies in NX environment. Managed component interfaces and led the workflow process in Team Center.",
            "logo":"pratt-logo.png"},
            {"position":"Mechanical Engineer Internship",
            "company":"Bell Helicopters",
            "dates":"May 2016 - Aug 2016",
            "address":"Piney Flats, TN",
            "description":"Researched, developed, and built prototype tooling. Designed dynamic part assemblies in Autodesk Inventor. Wrote and executed test plans and engaged in creative problem solving. Conducted dimensional, surface roughness, and temperature studies. Conducted preliminary research for system, material, and process upgrades.",
            "logo":"bell-logo.png"},
            {"position":"Quality Engineer Internship",
            "company":"Nissan North America",
            "dates":"May 2015 – Aug 2015",
            "address":"Smyrna, TN",
            "description":"Researched, developed, and built prototype tooling. Designed dynamic part assemblies in Autodesk Inventor. Wrote and executed test plans and engaged in creative problem solving. Conducted dimensional, surface roughness, and temperature studies. Conducted preliminary research for system, material, and process upgrades.",
            "logo":"nissan-logo.png"}
        ],
        "military": [
            {"position":"Human Intelligence Collector",
            "company":"Tennessee Army National Guard",
            "dates":"2011 - 2017",
            "address":"Nashville, TN 37204",
            "description":"Documented, compiled and generated intelligence reports. Operated and maintained intelligence equipment. Executed military orders with integrity, strong work ethic and commitment to excellence.",
            "logo":"guard-logo.png"}
        ],
        "education":[
            {"school":"Georgia Institute of Technology",
            "degree":"Master of Science in Data Analytics",
            "dates":"2019 - 2021"},
            {"school":"University of Tennessee Knoxville",
            "degree":"Bachelor of Mechanical Engineering",
            "dates":"2012-2017"},
            {"school":"Politecnico di Torino Italy",
            "degree":"Mechanical Engineering Study Abroad",
            "dates":"2017"}
        ]
    },
    "art":[
        {"img":"a1.jpg"},
        {"img":"a2.jpg"},
        {"img":"a3.jpg"},
        {"img":"a4.jpg"},
        {"img":"a5.jpg"},
        {"img":"a6.jpg"},
        {"img":"a7.jpg"},
        {"img":"a8.jpg"},
        {"img":"a9.jpg"},
        {"img":"a10.jpg"},
        {"img":"a11.jpg"},
        {"img":"a12.jpg"},
        {"img":"a13.jpg"},
        {"img":"a14.jpg"},
        {"img":"a15.jpg"},
        {"img":"a16.jpg"},
        {"img":"a17.jpg"},
        {"img":"a18.jpg"},
        {"img":"a19.jpg"},
        {"img":"a20.jpg"},
        {"img":"a21.jpg"},
        {"img":"a22.jpg"},
        {"img":"a23.jpg"},
        {"img":"a24.jpg"},
        {"img":"a25.jpg"},
        {"img":"a26.jpg"},
        {"img":"a27.jpg"}
    ],
    "projects":[
        {
            "title":"Body Dimensions Data Collection",
            "description":"The data collection portal facilitates data collection and organization for a machine learning application. ",
            "url":"https://www.dennis-morozov-projects.com/",
            "img":"body_measurements.png"
        },
        {
            "title":"Blog: Generative AI Explained: Part I",
            "description":"The blog serves as an introduction into the generative AI topic for technical audience and non-technical audience.",
            "url":"https://medium.com/analytics-vidhya/what-is-generative-about-generative-ai-part-i-566cd7ff7a86",
            "img":"gen1.png"
        },
        {
            "title":"Blog: Generative AI Explained: Part II",
            "description":"The blog surveys common GenAI architectures, and captures key characteristics of GenAI.",
            "url":"https://medium.com/analytics-vidhya/generative-ai-engines-part-ii-50fab7bc22a",
            "img":"gen2.png"
        },
        {
            "title":"Recipe Explorer Network",
            "description":"The recipe explorer presents users a novel way to explore recipes. The user inputs a set of ingredients into a text box, the user then selects how many recipes to return, then clicks run. The returned recipes graph is based on a k-means machine learning engine trained just for this project that matches user provided ingredients, with a mixed graph of recipes. The whole experience is meant to be exploratory. Users can then continue their discovery journey by selecting one of the returned recipes as input for new recipe recommendations.",
            "url":"https://github.com/dennismdan/recipe_explorer",
            "img":"recipe_explorer.png"
        },
        {
            "title":"Car Dealership Client and Database",
            "description":"Full stack application design that includes: a client that car dealership employees can interact with, backend functionality and full relational database design. This project was based on a database masters course and it implemented principals of relational data base design. The client and database interactions were developed with django, while the database was built with SQL",
            "url":"https://github.com/dennismdan/car_dealership_database_proj",
            "img":"car_dealership_db.png"
        },
        {
            "title":"Twitter Sentiment Analysis",
            "description":"Developed several natural language processing models (NLP) using TensorFlow and PyTorch and several neural networks architectures (transformers and CNNs) to How users interact and influence the sentiment on topics overall.",
            "url":"https://github.com/dennismdan/twitter-sentiment-analysis",
            "img":"twitter_sentiment_analysis.png"
        },
        {
            "title":"Blog: Sentiment Analysis: Introduction with a Simple Technical Example.",
            "description":"Sentiment analysis is the term used to study the general mood/feeling/ or sentiment of human language. It can also be applied to other fields (perhaps humpback whale mating songs) but we will only look at sentiment analysis of text.",
            "url":"https://medium.com/analytics-vidhya/sentimental-analysis-introduction-with-a-simple-technical-example-f9abaed5e58a",
            "img":"sentiment_analysis_example.png"
        },
        {
            "title":"Blog: Tensordot — Multidimensional Dot Product — Explained.",
            "description":"The multidimensional operator, axes destroyer and dimensional transformer, tensordot has earned its rightful place in the coliseum of super useful multi-dimensional matrix operators. Tensordot is a powerful tool for tensors (multi-dimensional matrices), but it can also be a bit elusive and seem slightly magical. The difficulty in gaining a robust intuition for tensordot is mostly due to the fact that if you need a tensordot operation, your mind is likely already dazed with keeping track of all the dimensions of a tensor. To get a full grasp of tensordots, it helps to start from simple matrices then slowly build an intuition all the way up to multidimensional operations.",
            "url":"https://medium.com/analytics-vidhya/tensordot-explained-6673cfa5697f",
            "img":"tensor_dor_art.jpeg"
        },
        {
            "title":"Blog: Sentiment Analysis of Twitter Text And Visualization Methods.",
            "description":"Twitter has connected people to form rich online communities engaged in energetic, informative, and sometime misleading discussions. Imagine a basketball arena full of people huddled in smaller subgroups. Each subgroup is engaged in passionate conversations, talking away with each other and over each other. Some of the folks are holding calm conversations about their daily lives, others scream at each other in political protests, while in the right corner, next to the benches, a smaller group of folks recite poems leisurely. Conversations on twitter are rich in information, emotion and opinion, which lands tweets as a superb study for opinion mining and sentiment analysis.",
            "url":"https://dennisalexandermorozov.medium.com/sentiment-analysis-of-twitter-text-and-visualization-methods-d6ab365ccfbc",
            "img":"sentiment_analysis.png"
        }
    ]
}
